text = """

Последнее время мой взор редко обращался в сторону русских авторов. А вот тут решился. Выбор пал на известного писателя 
Алексея Пехова (уж очень многие его хвалили). И что ж, я ни капли не пожалел! Получил огромное удовольствие от чтения. 
Но обо всем по порядку.

В мире этой книги люди после смерти могут не уйти на покой, а остаться в виде призраков – так называемых «душ». И души 
эти бывают безвредными – светлыми, и темными – опасными для людей. И для борьбы с темными душами существует 
Братство Стражей. Это люди с Даром, способные видеть души (для остальных они незаметны). Вооружены Стражи 
черными клинками, способными упокаивать души. Помимо этого на вооружении Братства есть особая магия, созданная для 
уничтожения темных сущностей. Система магии у автора, кстати, проработана очень хорошо. Поединки, как магические, так 
и обычные, прописаны просто превосходно. Они красочны, динамичны и от них порой просто захватывает дух.

В противовес братству существует Орден Праведности или по-другому «законники». Хотя они и делают по сути одну и ту же 
работу, больше соперничают между собой. За этим противостоянием, с его интригами и загадками, приятно наблюдать.

Мир «Стража» похож на Европу в Позднее Средневековье. И конечно же огромную роль в то время играла Церковь. Поэтому 
закономерно и логично выглядит Инквизиция, клирики, кардиналы и монашеские ордена. Церковь, к слову, тоже обладает 
своей магией, направленной на уничтожение нежити и демонических тварей. Лично я не очень люблю тему религии и 
христианства в фэнтези, но у Пехова она настолько логично и гармонично вписана в сюжет, что не вызывает отторжения. 
Помимо этого здесь в наличии и различные нечеловеческие расы, и ведьмы, и колдуны.

По жанру данное произведение можно отнести к героическому фэнтези. Книга состоит из нескольких историй, связанных общим 
сюжетом. Здесь, почему-то, мне видится сходство с историей Геральта из Ривии (странствующий охотник за темными тварями).

Автору явно удались персонажи. Главный герой – страж Людвиг ван Нормайенн, получился образцом благородного война, 
защитника слабых. Но и он не лишен своих тараканов, не скатывается в образ киношного супергероя. Между нуждами 
Братства и чувством справедливости, он неизменно выбирает последнее, стараясь поступать правильно. У него есть 
определенный кодекс чести, который он соблюдает. Но и второстепенные герои вышли яркими, запоминающимися и 
харизматичными. И речь не только о постоянным спутниках – Проповеднике и Пугале (они просто шедевральны!), но и о 
прочих героях – Шуко, Карл, Гера и прочие.

Роман читается легко, юмор остроумен и ненавязчив, повествование динамичное и не буксует на месте. Общее впечатление 
крайне положительное. Сразу же приступил к продолжению.

P.S.: Интересно же узнать, что задумало Пугало…
"""